<a href="https://colab.research.google.com/github/anirbanghoshsbi/pandas/blob/master/pandas_merging.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# import the libraries
import pandas as pd

In [0]:
# create a dataframe
employee_data = {'emp_id':[1,2,3,4,5,6,7],'emp_name':['A','B','C','D','E','F','G']}

In [0]:
dataframe_employee = pd.DataFrame(employee_data)

In [73]:
dataframe_employee

   emp_id emp_name
0       1        A
1       2        B
2       3        C
3       4        D
4       5        E
5       6        F
6       7        G

In [0]:
# create a new dataframe for the sales figure of the data
sales_data ={'emp_id':[6,7,8,9,10,11,12],'total_sales':[500,253,154,200,147,259,180], 'emp_name':['F','G','H','I','J','K','L']}
emp_sales= pd.DataFrame(sales_data)

In [75]:
# see the dataframe
emp_sales

   emp_id emp_name  total_sales
0       6        F          500
1       7        G          253
2       8        H          154
3       9        I          200
4      10        J          147
5      11        K          259
6      12        L          180

In [0]:
# merge the data
dataframe_merge = pd.merge(dataframe_employee,emp_sales,on='emp_id') 
# merge always occur on the columns and is by default inner which means common column is taken as the key column

In [77]:
dataframe_merge

   emp_id emp_name_x emp_name_y  total_sales
0       6          F          F          500
1       7          G          G          253

In [0]:
dataframe_merge_emp_name = pd.merge(dataframe_employee , emp_sales , on='emp_name',how='inner')

In [79]:
dataframe_merge_emp_name

   emp_id_x emp_name  emp_id_y  total_sales
0         6        F         6          500
1         7        G         7          253

In [80]:
dataframe_merge_emp_id_outer=pd.merge(dataframe_employee, emp_sales , on='emp_id',how='outer')
dataframe_merge_emp_id_outer

    emp_id emp_name_x emp_name_y  total_sales
0        1          A        NaN          NaN
1        2          B        NaN          NaN
2        3          C        NaN          NaN
3        4          D        NaN          NaN
4        5          E        NaN          NaN
5        6          F          F        500.0
6        7          G          G        253.0
7        8        NaN          H        154.0
8        9        NaN          I        200.0
9       10        NaN          J        147.0
10      11        NaN          K        259.0
11      12        NaN          L        180.0

In [0]:
# change the nans with the names
dataframe_merge_emp_id_outer['emp_name_y']=dataframe_merge_emp_id_outer['emp_name_y'].replace('NaN','Null')

In [82]:
dataframe_merge_emp_id_outer

    emp_id emp_name_x emp_name_y  total_sales
0        1          A        NaN          NaN
1        2          B        NaN          NaN
2        3          C        NaN          NaN
3        4          D        NaN          NaN
4        5          E        NaN          NaN
5        6          F          F        500.0
6        7          G          G        253.0
7        8        NaN          H        154.0
8        9        NaN          I        200.0
9       10        NaN          J        147.0
10      11        NaN          K        259.0
11      12        NaN          L        180.0

In [0]:
import numpy as np
dataframe_merge_emp_id_outer['emp_name_y']=dataframe_merge_emp_id_outer['emp_name_y'].replace(np.NaN,'Null').head(4)

In [84]:
dataframe_merge_emp_id_outer

    emp_id emp_name_x emp_name_y  total_sales
0        1          A       Null          NaN
1        2          B       Null          NaN
2        3          C       Null          NaN
3        4          D       Null          NaN
4        5          E        NaN          NaN
5        6          F        NaN        500.0
6        7          G        NaN        253.0
7        8        NaN        NaN        154.0
8        9        NaN        NaN        200.0
9       10        NaN        NaN        147.0
10      11        NaN        NaN        259.0
11      12        NaN        NaN        180.0

In [88]:
'''for name in dataframe_merge_emp_id_outer['emp_name_x']:
  if dataframe_merge_emp_id_outer['emp_name_y']=='Null':
     dataframe_merge_emp_id_outer['emp_name_y']=name'''

ValueError: ignored

In [87]:
dataframe_merge_emp_id_outer

    emp_id emp_name_x emp_name_y  total_sales
0        1          A       Null          NaN
1        2          B       Null          NaN
2        3          C       Null          NaN
3        4          D       Null          NaN
4        5          E        NaN          NaN
5        6          F        NaN        500.0
6        7          G        NaN        253.0
7        8        NaN        NaN        154.0
8        9        NaN        NaN        200.0
9       10        NaN        NaN        147.0
10      11        NaN        NaN        259.0
11      12        NaN        NaN        180.0